---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.GetExportPatternTable
source: html/6f852987-50c6-e44a-398a-b23a01a1a0a5.htm
---
# Autodesk.Revit.DB.BaseExportOptions.GetExportPatternTable Method

Gets a copy of the pattern table.

## Syntax (C#)
```csharp
public ExportPatternTable GetExportPatternTable()
```

## Returns
The pattern table.